AILIFE4798/Hoverboard-Firmware-Hack-Gen2.x-MM32/HoverBoardMindMotion/Src/autodetect.c
			}
			break;
		case MODE_HALL :
			if(serialRead=='\n'||serialRead=='\r'){
				if(detectall){
					mode=MODE_LED;    //next step
					init=1;
					sTimingDelay=0;
				}else{
					saveNexit();    //save config if it is changed
				}
				wait=0;
			}else if(serialRead=='y'){
				wait=0;    //continue running after user confirmed
			}else if(serialRead=='i'){
				INVERT_LOWSIDE = !INVERT_LOWSIDE;
				UART_SendString("\n\rlowside ");
				UART_SendString(INVERT_LOWSIDE ? "inverted" : "normal");
				TIM1_init(PWM_RES_AD, 0);
				if(!wait){
					TIM_CtrlPWMOutputs(TIM1, ENABLE);
					TIM1->CCR1=4000;    //spin motor at 50% pwm
					TIM1->CCR2=4000;
					TIM1->CCR3=4000;
				}
			}
			break;
		case MODE_LED :
			switch(serialRead){
				case '\n':
				case '\r':
					if(detectall){
						mode=MODE_VBAT;
						init=1;
						sTimingDelay=0;
					}else{
						saveNexit();
					}
					for(uint8_t i=0;i<PINCOUNT;i++){
						if(!used(i)){
							pinMode(i,INPUT);    //turn all pins back off after leaving
						}
					}
				break;
				case 'w':
				case 'r':
				case 'g':
				case 'b':
				case 'u':
				case 'l':
				case 'z':
					pinMode(selpin, serialRead=='w'&&!ledmode ? INPUT_PULLUP : INPUT);
					//if pin is saved turn it off, if its not left it on so easy to see what led is still left
					switch(serialRead){
						case 'r':
							pinMode(LEDRPIN, INPUT_PULLUP);
							LEDRPIN=selpin;
							UART_SendString("\r\nLEDR:");
							UART_SendString(&PXX[selpin][0]);
						break;
						case 'g':
							pinMode(LEDGPIN, INPUT_PULLUP);
							LEDGPIN=selpin;
							UART_SendString("\r\nLEDG:");
							UART_SendString(&PXX[selpin][0]);
						break;
						case 'b':
							pinMode(LEDBPIN, INPUT_PULLUP);
							LEDBPIN=selpin;
							UART_SendString("\r\nLEDB:");
							UART_SendString(&PXX[selpin][0]);
						break;
						case 'u':
							pinMode(LEDUPIN, INPUT_PULLUP);
							LEDUPIN=selpin;
							UART_SendString("\r\nUpper LED:");
							UART_SendString(&PXX[selpin][0]);
						break;
						case 'l':
							pinMode(LEDDPIN, INPUT_PULLUP);
							LEDDPIN=selpin;
							UART_SendString("\r\nLower LED:");
							UART_SendString(&PXX[selpin][0]);
						break;
						case 'z':
							pinMode(BUZZERPIN, INPUT_PULLUP);
							BUZZERPIN=selpin;
							UART_SendString("\r\nBuzzer:");
							UART_SendString(&PXX[selpin][0]);
						break;
					}
					if(serialRead!='w'){
						UART_SendString("\r\n");
					}
					do{
						if(selpin==PINCOUNT-1){
							selpin=0;
						}else{
							selpin++;
						}
					}while(used(selpin));    //find next unused pin
				break;
				case 's':
					pinMode(selpin,ledmode ? INPUT : INPUT_PULLUP);
					do{
						if(selpin==0){
							selpin=PINCOUNT-1;
						}else{
							selpin--;
						}
					}while(used(selpin));
				break;
				case 'm':
					init=1;
					ledmode=!ledmode;
				break;
			}
			UART_SendString("\rNow trying:");
			UART_SendString(&PXX[selpin][0]);
			UART_SendString("  ");
			break;
			case MODE_VBAT :
			if(serialRead=='\n'||serialRead=='\r'){
				if(detectall){
					if(masterslave){    //slave cannot detect button
						mode=MODE_BUTTON;
						init=1;
						sTimingDelay=0;
					}else{
						mode=MODE_SLAVEID;
						init=1;
						sTimingDelay=0;
					}
				}else{
					sTimingDelay=0;
					saveNexit();
				}
			}else if(serialRead=='f'){
				showalladc=!showalladc;    //toggle extreme value filtering
			}else if(serialRead>='0'&&serialRead<='9'){    //number pressed
				VBATPIN=adcs[serialRead-'0'].io;    //save pin
				UART_SendString("\r\nVBAT:");
				UART_SendString(&PXX[VBATPIN][0]);
			}
			break;
			case MODE_BUTTON :
				if(serialRead=='\n'||serialRead=='\r'){
					if(detectall){
						mode=MODE_SLAVEID;
						init=1;
						sTimingDelay=0;
					}else{
						saveNexit();
					}
				}else if(serialRead=='e'){	
					doinloop=1;    //button pin latch pin workaround
				}
			break;
			case MODE_SLAVEID :
				if(serialRead>='0'&&serialRead<='9'){
					data=data*10+(serialRead-'0');
				}else if(serialRead=='\n'||serialRead=='\r'){
					if(data<256){
						SLAVE_ID=data;
						char buffer[32];
						sprintf(&buffer[0],"\r\nSlaveID: %i\r\n",SLAVE_ID);
						UART_SendString(&buffer[0]);
						saveNexit();
					}else{
						UART_SendString("\r\n\aInvalid SlaveID,it must be between 0 and 255\r\n");
						data=0;
					}
				}else if(serialRead=='\b'||serialRead==127){    //backspace
					data=data/10;
				}
			break;
			case MODE_CLI :
				switch(serialRead){
					case '\r':    //run command entered before
					case '\n':
						switch(command){
							case 'r':    //read address
								if(addrparsemode==2){
									addrstr[addrlen]='\0';
									uint8_t parsedata=255;
									for(uint8_t i=0;i<64;i++){
										if(!strcmp((const char *)addrstr,(const char *)addrdescription[i])){
											parsedata=i;
											break;
										}
									}
									if(parsedata!=255){
										address=parsedata;
									}else{
										UART_SendString("\r\n\aaddress \"");
										UART_SendString(&addrstr[0]);
										UART_SendString("\" does not exist");
										break;
									}
								}
								if(address<64){
									printstorage(address);
								}else{
									UART_SendString("\r\n\aInvalid address");
								}
							break;
							case 'w':    //write to address
								if(addrparsemode==2){
									addrstr[addrlen]='\0';
									uint8_t parsedata=255;
									for(uint8_t i=0;i<64;i++){
										if(!strcmp((const char *)addrstr,(const char *)addrdescription[i])){
											parsedata=i;
											break;
										}
									}
									if(parsedata!=255){
										address=parsedata;
									}else{
										UART_SendString("\r\n\aaddress \"");
										UART_SendString(&addrstr[0]);
										UART_SendString("\" does not exist");
										break;
									}
								}
								if(dataparsemode==2){
									datastr[datalen]='\0';
									uint8_t parsedata=255;
									for(uint8_t i=0;i<PINCOUNT;i++){
										if(!strcmp((const char *)datastr,(const char *)PXX[i])){
											parsedata=i;
											break;
										}
									}
									if(parsedata!=255){
										data=parsedata;
									}else{
										UART_SendString("\r\n\apin \"");
										UART_SendString(&datastr[0]);
										UART_SendString("\" does not exist");
										break;
									}
								}
								if(address<64){
									pinstorage[address]=data;
									printstorage(address);
								}else{
									UART_SendString("\r\n\aInvalid address");
								}
								
							break;
							case 'h':    //help
								UART_SendString("\r\n\nThis tool allow you to modify and view all saved pinouts and settings\n\r\n\rUsage:  [command] <address> <value>\n\r\n\rCommands: \n\r\n\r r     read saved data\n\r w     write data\n\r h     display this help page\n\r l     list all data\n\r g     generate pinstorage variable initializer to copy in firmware\n\r e     erase all data\n\r x     exit command line tool and go back to main menu\n\r i     show current version info\n\r\n\rAddresses:\r\n\n");
								for(uint8_t i=0;i<64;i++){
									char buffer[16];
									sprintf(&buffer[0],"index %i: ",i);
									UART_SendString(&buffer[0]);
									UART_SendString(&addrdescription[i][0]);
									UART_SendString("\r\n");
								}
							break;
							case 'l':    //list all values
								for(uint8_t i=0;i<64;i++){
									printstorage(i);
								}
							break;
							case 'g':    //generate pinout file to compile custom firmware
								UART_SendString("\r\nuint16_t pinstorage[64]={");
								for(uint8_t i=0;i<64;i++){			
									char buffer[16];
									sprintf(&buffer[0],"%i, ",pinstorage[i]);
									UART_SendString(&buffer[0]);
								}
								UART_SendString("\b\b};");    //\b to delete extra ,
							break;
							case 'e':    //write all ff to eeprom to erase it
								saverase=1;
								mode=MODE_SAVE;
								init=1;
							break;
							case 'x':
								saveNexit();    //leave terminal
							break;
							case 0:
								__NOP();    //display new line only if no command is entered
							break;
							case 'i':
								UART_SendString(VERSION_INFO);    //leave terminal
							break;
							default:    //command not found
								UART_SendString("\r\n\aCommand\"");
								UART_Send_Byte(command);
								UART_SendString("\"does not exist");
							break;
						}
						UART_SendString("\r\npinfinder~$ ");
						command=0;    //reset for next time
						address=0;
						data=0;
						stage=0;
						datalen=0;
						addrlen=0;
						dataparsemode=0;
						addrparsemode=0;
					break;
					case ' ':    //space as seperator for command
						stage++;
					break;
					case 127:
					case '\b':
						switch(stage){
							case 0 :    //command
								command=0;
							break;
							case 1 :    //address
								if(addrparsemode==2){
									if(addrlen>0){
										addrlen--;
									}
								}else{
									address=address/10;
								}
							break;
							case 2 :    //value
								if(dataparsemode==2){
									if(datalen>0){
										datalen--;
									}
								}else{
									data=data/10;
								}
							break;
						}
					break;
					default:    //parse command without using sscanf
						switch(stage){
							case 0 :    //command
								if(command==0){    //only capture first digit
									command=serialRead;
								}
							break;
							case 1 :    //address
								if(!(serialRead>='0'&&serialRead<='9')||addrparsemode==2){
									addrstr[addrlen++]=serialRead;
									addrparsemode=2;
								}else{
									address=address*10+(serialRead-'0');    //shift left and add new value
									addrparsemode=1;
								}
							break;
							case 2 :    //value
								if(!(serialRead>='0'&&serialRead<='9')||dataparsemode==2){
									datastr[datalen++]=serialRead;
									dataparsemode=2;
								}else{
									data=data*10+(serialRead-'0');
									dataparsemode=1;
								}
							break;
						}
					break;
				}
			break;
			case MODE_TESTROTATE :
				switch(serialRead){
					case '\r':
					case '\n':
						TIM1->CCR1=0;
						TIM1->CCR2=0;
						TIM1->CCR3=0;
						TIM_CtrlPWMOutputs(TIM1, DISABLE);    //stop motor after exit
						step=0;
						commutate();
						mode=MODE_MENU;
						init=1;
					break;
					case '+':
						testrotatespeed+=100;
						if(testrotatespeed>1000){
							testrotatespeed=1000;
						}
						char buffer2[16];
						sprintf(&buffer2[0],"\rSpeed:%i   ",testrotatespeed);
						UART_SendString(&buffer2[0]);
					break;
					case '-':
						testrotatespeed-=100;
						if(testrotatespeed<-1000){
							testrotatespeed=-1000;
						}
						char buffer[16];
						sprintf(&buffer[0],"\rSpeed:%i   ",testrotatespeed);
						UART_SendString(&buffer[0]);					
					break;
				}	
			break;	
			case MODE_SAVE :
				switch(serialRead){
					case 'y':
						if(saverase){
							for(uint8_t i=0;i<64;i++){
								pinstorage[i]=0;
							}
							if(EEPROM_Write((u8*)pinstorage, 2 * 64)){
								DELAY_Ms(100);
								UART_SendString("\r\nEEPROM erase complete,please power cycle to take effect\r\n");
								UART_SendString("core helted\r\n");
								while(1){
									__NOP();
								}
							}else{
								UART_SendString("\r\n\aEEPROM erase failed\r\n");
							}
						}else{
							if(EEPROM_Write((u8*)pinstorage, 2 * 64)){
								UART_SendString("\r\nconfiguration saved\r\n");
								mode=MODE_MENU;
								init=1;
							}else{
								UART_SendString("\r\n\aEEPROM write failed\r\n");
							}
						}
					case 'n':
						EEPROM_Read((u8*)pinstorage, 2 * 64);
						mode=MODE_MENU;
						init=1;
						saverase=0;
					break;
					default:
						UART_SendString("\r\n\aY/N?");    //prevent acidently cancellation you have to press y or n
					break;
				}
			break;
	}
}
	

void simhallupdate(){    
	while(HALLAPIN==255||HALLBPIN==255||HALLCPIN==255){    //wait till every sensor is found
		for(uint8_t j=1;j<30;j++){
			for(uint8_t i=1;i<7;i++){
				step=i;    //sensorless drive
				commutate();
				DELAY_Ms(30-j);
				for(uint8_t i=0;i<PINCOUNT;i++){
					if(!used(i)){    //check every possible pin
						switch (step){
							case 1:    //if current state does not match what it should,remove from possible pins list
								hallA[i]=!digitalRead(i)&&hallA[i];
								hallB[i]=digitalRead(i)&&hallB[i];
								hallC[i]=digitalRead(i)&&hallC[i];
							break;
							case 2:    //if a pin have been removed not add it back in next step
								hallA[i]=!digitalRead(i)&&hallA[i];
								hallB[i]=!digitalRead(i)&&hallB[i];
								hallC[i]=digitalRead(i)&&hallC[i];
							break;
							case 3:
								hallA[i]=digitalRead(i)&&hallA[i];
								hallB[i]=!digitalRead(i)&&hallB[i];
								hallC[i]=digitalRead(i)&&hallC[i];
							break;
							case 4:
								hallA[i]=digitalRead(i)&&hallA[i];
								hallB[i]=!digitalRead(i)&&hallB[i];
								hallC[i]=!digitalRead(i)&&hallC[i];
							break;
							case 5:
								hallA[i]=digitalRead(i)&&hallA[i];
								hallB[i]=digitalRead(i)&&hallB[i];
								hallC[i]=!digitalRead(i)&&hallC[i];
							break;
							case 6:
								hallA[i]=!digitalRead(i)&&hallA[i];
								hallB[i]=digitalRead(i)&&hallB[i];
								hallC[i]=!digitalRead(i)&&hallC[i];
							break;
						}
					}
				}
				//DELAY_Ms(j);
			}
			
			for(uint8_t i=0;i<PINCOUNT;i++){
				if(hallA[i]){
					HALLAPIN=i;    //save and print found pin
					UART_SendString("\r\nHALLA:");
					UART_SendString(&PXX[i][0]);
				}
				if(hallB[i]){
					HALLBPIN=i;
					UART_SendString("\r\nHALLB:");
					UART_SendString(&PXX[i][0]);
				}
				if(hallC[i]){
					HALLCPIN=i;
					UART_SendString("\r\nHALLC:");
					UART_SendString(&PXX[i][0]);
				}
				
