AILIFE4798/Hoverboard-Firmware-Hack-Gen2.x-MM32/HoverBoardMindMotion/Src/autodetect.c
			}
			for(uint8_t i=0;i<PINCOUNT;i++){    //everything is possible
				hallA[i] = 1;
				hallB[i] = 1;
				hallC[i] = 1;
			}
			for(uint8_t i=0;i<PINCOUNT;i++){    //remove used pins from possible pins
				if(used(i)){
					hallA[i]=0;
					hallB[i]=0;
					hallC[i]=0;
				}
			}
			if(HALLAPIN==255||HALLBPIN==255||HALLCPIN==255){
				UART_SendString("\r\nretry");
				HALLAPIN=HALLBPIN=HALLCPIN=255;
			}else if(HALLAPIN!=255&&HALLBPIN!=255&&HALLCPIN!=255){
				UART_SendString("\r\nDetection sucessful");
				uint8_t avalid,bvalid,cvalid,timnum=0;
				for(uint8_t i=0;i<TIMCOUNT;i++){ 
					if(halltims[i].io == HALLAPIN){
						avalid=1;
						timnum+=halltims[i].tim2;
					}
					if(halltims[i].io == HALLBPIN){
						bvalid=1;
						timnum+=halltims[i].tim2;
					}
					if(halltims[i].io == HALLCPIN){
						cvalid=1;
						timnum+=halltims[i].tim2;
					}
				}
				if(!(avalid&&bvalid&&cvalid)){
					UART_SendString("\r\n\aWarning:pinmodeAF of HALL pin ");
					if(avalid){
						UART_SendString(&PXX[HALLAPIN][0]);
					}
					if(bvalid){
						UART_SendString(&PXX[HALLBPIN][0]);
					}
					if(cvalid){
						UART_SendString(&PXX[HALLCPIN][0]);
					}
					UART_SendString(" is not found, it is sugessted to redo the detection");
				}else if(!(timnum==0||timnum==3)){
					UART_SendString("\r\n\aWarning:HALL sensor pin timer mapping is invalid, it is sugessted to redo the detection");
				}
				break;
			}
			if(mode!=MODE_HALL){
				break;
			}
		}
		if(mode!=MODE_HALL){
			break;
		}
	}
	TIM1->CCR1=0;    //disable motor after all pins is found
	TIM1->CCR2=0;
	TIM1->CCR3=0;
}	


/*
void simhallupdate(){    //does not work : (
	for(uint8_t i=0;i<33;i++){
		if(!used(i)){
			laststate[i]=digitalRead(pins[i][0],pins[i][1]);
		}
	}
	while(halltmp[2]==255){
		uint8_t tmpindex=0;
		for(uint8_t i=0;i<33;i++){
			if(millis-lastCommutation>30){
				step++;
				if(step>6){
					step=1;
					revolutions++;
				}
				commutate();
				lastCommutation=millis;
			}
			if(!used(i)){
				TIM_CtrlPWMOutputs(TIM1, DISABLE);
				if(laststate[i]!=digitalRead(pins[i][0],pins[i][1])){
					TIM_CtrlPWMOutputs(TIM1, ENABLE);
					char buffer[16];
					uint32_t halltime=millis-lastchange[i];
					sprintf(&buffer,"\nhalltime:%i",halltime);
					UART_Send_Group(&buffer[0],16);
					if(halltime>20&&halltime<100){
						pinstorage[tmpindex] = halltmp[tmpindex] = i;
						tmpindex++;
						UART_Send_Group(&PXX[i][0],4);
					}
					lastchange[i]=millis;
				}
				TIM_CtrlPWMOutputs(TIM1, ENABLE);
				DELAY_Ms(1);
			}
		}
	}
}
*/

void autoDetectInit(){
	switch (mode){
		case MODE_MENU :
			GetChipUID();
			UART_SendString("\n\n\n\n\r");
			UART_Send_Group(&banner[0],464);
			UART_SendString("Board type:");
			UART_SendString(masterslave?"Master":"Slave");
			char buffer[80];
			sprintf(&buffer[0],"  MCU Voltage:%fV  Serial number:%02X%02X%02X%02X%02X%02X%02X%02X%02X%02X%02X%02X\n\r",vcc,device_id_data[0],device_id_data[1],device_id_data[2],device_id_data[3],device_id_data[4],device_id_data[5],device_id_data[6],device_id_data[7],device_id_data[8],device_id_data[9],device_id_data[10],device_id_data[11]);
			UART_SendString(&buffer[0]);
			UART_SendString("Welcome to PinFinder, press number key to choose action.\n\r");
			UART_SendString("  (0)-Auto detect all pins.\n\r");
			UART_SendString("  (1)-Auto detect HALL sensor.\n\r");
			UART_SendString("  (2)-Auto detect LED and buzzer.\n\r");
			UART_SendString("  (3)-Auto detect battery voltage.\n\r");
			UART_SendString("  (4)-Auto detect total current.\n\r");
			UART_SendString("  (5)-Auto detect power button.\n\r");
			UART_SendString("  (6)-Set Slave ID\n\r");
			UART_SendString("  (7)-Modify configurations manually by command line.\n\r");
			UART_SendString("  (8)-Test motor rotation.\n\r");
			UART_SendString("  (9)-Power off.\n\r>");
			for(uint8_t i=0;i<64;i++){
				prevpinstorage[i]=pinstorage[i];
			}
		break;
		case MODE_HALL :
			UART_SendString("\n\rthis will spin motor slowly to detect hall sensor pins,if it takes too long please increase input voltage to 42v, if the motor does not move at all or a short circuit occured press I to invert lowside drive signal\n\rpress Y to start,Enter to return to menu\n\r");
			UART_SendString("lowside ");
			UART_SendString(INVERT_LOWSIDE ? "inverted" : "normal");
			wait=1;
			while(wait){
				__NOP();
				__NOP();
			}
			if(mode==MODE_HALL){
				TIM_CtrlPWMOutputs(TIM1, ENABLE);
				TIM1->CCR1=4000;    //spin motor at 50% pwm
				TIM1->CCR2=4000;
				TIM1->CCR3=4000;
				for(uint8_t i=0;i<PINCOUNT;i++){
					hallA[i] = 1;
					hallB[i] = 1;
					hallC[i] = 1;
				}
				for(uint8_t i=0;i<PINCOUNT;i++){    //remove used pins from hall array
					if(used(i)){
						hallA[i]=0;
						hallB[i]=0;
						hallC[i]=0;
					}
				}
				HALLAPIN=HALLBPIN=HALLCPIN=255;
			/*
				halltmp[0]=halltmp[1]=halltmp[2]=255;
				revolutions=0;
			*/
			}
		break;
		case MODE_LED :
			if(ledmode){
				UART_SendString("\n\rAll pins will be set low, the selected pin will blink, the already saved pins will remain off. If a LED is stuck on it cannot be controled.\r\npress W to go to next pin\r\npress S to go to previous pin\n\rPress R to save as red LED\r\nPress G to save as green LED\r\nPress B to save as blue LED(or orange on some board)\r\nPress U to save as upper LED\r\nPress L to save as lower LED\r\nPress Z to save as buzzer\r\nPress M to switch to all led off by default\r\npress Enter to go back to main menu\r\n");
			}else{
				UART_SendString("\n\rAll pins will be set high, the selected pin will blink, the already saved pins will remain off. If a LED does not light up, it is broken.\r\npress W to go to next pin\r\npress S to go to previous pin\n\rPress R to save as red LED\r\nPress G to save as green LED\r\nPress B to save as blue LED(or orange on some board)\r\nPress U to save as upper LED\r\nPress L to save as lower LED\r\nPress Z to save as buzzer\r\nPress M to switch to all led on by default\r\npress Enter to go back to main menu\r\n");
			}
			for(uint8_t i=0;i<PINCOUNT;i++){
				if(!used(i)){
					pinMode(i,ledmode ? INPUT : INPUT_PULLUP);
				}
			}
			selpin=0;
			while(used(selpin)){    //find the first unused pin to start
				selpin++;
			}
			UART_SendString("\rNow trying:");
			UART_SendString(&PXX[selpin][0]);
			UART_SendString("  ");
		break;
		case MODE_VBAT :
			UART_SendString("\r\nA list of pin and voltage will be displayed, check the board input voltage with multimeter and select the closest one.\r\npress F to toggle automatic pin filtering\r\npress the number at the front of pin to save it\r\npress enter to return to main menu\r\n");
			TIM_CtrlPWMOutputs(TIM1, ENABLE);
			TIM1->CCR1=8192;
			TIM1->CCR2=8192;
			TIM1->CCR3=8192;
			step=0;    //close all low side mosfet to prevent reading phase current
			commutate();
			ADCALL_Init();    //enable every adc pins to be scanned at same time
			for(uint8_t i=0;i<ADCCOUNT;i++){
				if(!used(adcs[i].io)||adcs[i].io==VBATPIN){    //coresponding gpio is free
					ADC_RegularChannelConfig(ADC1, adcs[i].channel, 0, ADC_SampleTime_7_5Cycles);
					pinMode(adcs[i].io,INPUT_ADC);
					adcleft[i]=1;
				}else{
					adcleft[i]=0;
				}
			}
			ADC_SoftwareStartConvCmd(ADC1, ENABLE);    //enable adc
		break;
		case MODE_BUTTON :
			UART_SendString("\r\nPress and release power button once to detect automaticly\r\nIf button press is not registered,press E to enable fix, the board may acidently power off\r\npress Enter to return to main menu\r\n");
			for(uint8_t i=0;i<PINCOUNT;i++){
				if(!used(i)||i==BUTTONPIN){
					hallA[i]=digitalRead(i);    //hall array reused to detect change in io state for button
				}
			}
		break;
		case MODE_SLAVEID :
			UART_SendString("\r\nPlease enter the SlaveID for this board between 0 to 255\n\ryou must use this ID to communicate with the board in main firmware,so make sure to write it down\n\rnumber key to input,enter to save\n\n\rSlaveID:");
			data=0;
		break;
		case MODE_CLI :
			UART_SendString("\r\nWelcome to command line interface,type h for help\n\rpinfinder~$ ");
			command=0;    //initialize command
			address=0;
			data=0;
			stage=0;
		break;
		case MODE_TESTROTATE :
			UART_SendString("\r\nTest the motor with hall sensor commutation\r\npress + to increase speed\r\npress - to decrease speed\r\nnegative speed to spin backward\r\npress Enter to return to main menu\n\n\r");
			TIM_CtrlPWMOutputs(TIM1, ENABLE);
			TIM1->CCR1=0; 
			TIM1->CCR2=0;
			TIM1->CCR3=0;
			testrotatespeed=0;
			pinMode(HALLAPIN,INPUT);    //hall sensor floating input
			pinMode(HALLBPIN,INPUT);
			pinMode(HALLCPIN,INPUT);
		break;
		case MODE_SAVE :
			if(saverase){
				UART_SendString("\r\n\aYou are going to delete all saved pins and configurations,this process cannot be undone,are you sure to continue?Y/N\r\n>");
			}else{
				UART_SendString("\r\nChanges were made to the configurations, do you want to save it permanantly?Y/N\r\n>");
			}
		break;
	}		
}
	
void blinkLEDupdate(){
	if(millis-lastblink>100){
		pinMode(selpin,blinkstate ? INPUT : INPUT_PULLUP);    //toggle pullup pulldown to blink
		blinkstate=!blinkstate;
		lastblink=millis;
	}
	
