AILIFE4798/Hoverboard-Firmware-Hack-Gen2.x-MM32/HoverBoardMindMotion/Src/autodetect.c
}
	

void printvoltage(){
	for(uint8_t i=0;i<ADCCOUNT;i++){
		if(adcleft[i]){
			float vbattmp = (double)analogRead(adcs[i].io)*vcc*31/4096;    //auto calibrate for 5v and 3.3v board
			if(showalladc||(vbattmp>20&&vbattmp<45)){    //max battery voltage is 42v and some tollarance 45v, 20v is needed for gate driver to work
				char buffer[32];
				sprintf(&buffer[0],"%i->",i);
				UART_SendString(&buffer[0]);
				UART_SendString(&PXX[adcs[i].io][0]);
				sprintf(&buffer[0],":%fV\n\r",vbattmp);
				UART_SendString(&buffer[0]);
			}
		}
	}
	UART_SendString("================\n\r");
	DELAY_Ms(2000);
}	
	
	
void checkbutton(){
	if(doinloop){    //workaround
		UART_SendString("\r\nboard is about to redetect the self hold pin,please do not touch the button any more,only after the board power off you should turn it back on manually");
		BUTTONPIN=LATCHPIN;    //the current latch pin is actually buttonpin, so swap it
		LATCHPIN=65535;
		pinMode(BUTTONPIN,INPUT);    //release fake latch pin
		selfhold();    //detect self hold again with remaining pin
		masterslave = detectSelfHold();
		if(masterslave){
			UART_SendString("\r\nButton:");
			UART_SendString(&PXX[BUTTONPIN][0]);
			UART_SendString("\r\nLatch:");
			UART_SendString(&PXX[LATCHPIN][0]);
		}else{
			UART_SendString("\aWorkaround failed");
			LATCHPIN=65535;
			BUTTONPIN=65535;
		}
		doinloop=0;
	}else{
		for(uint8_t i=0;i<PINCOUNT;i++){
			if(!used(i)||i==BUTTONPIN){
				if(!hallA[i]&&digitalRead(i)){    //pin start as low and state changed to high
					BUTTONPIN=i;
					UART_SendString("\r\nButton:");
					UART_SendString(&PXX[i][0]);
					for(uint8_t i=0;i<PINCOUNT;i++){
						if(!used(i)){
							hallA[i]=digitalRead(i);    //hall array reused to detect change in io state for button
						}
					}
				}
			}
		}
	}
}


uint8_t restorecfg(){
	uint16_t tmp[64];
	EEPROM_Read((u8*)tmp, 2 * 64);
	if(tmp[MAGICNUM_POS]==MAGIC_NUMBER){    //verify config is valid
		for(uint8_t i=0;i<64;i++){
			pinstorage[i]=tmp[i];
		}
		return 1;
	}else{
		return 0;
	}
}

void testrotateloop(){    //adc is not initialized in pinfinder, so commutation done in main loop
	if(hallpos(dir)!=hallposprev){
		hallposprev=hallpos(dir);
		step=hallposprev;
		commutate();
	}
	int pwm=testrotatespeed*PWM_RES/1000;//1000~-1000 for all pwm resolution
	if(pwm>0){
	dir=1;
	}else{
	dir=0;
	}
	unsigned int abspeed=fabs((double)pwm);    // 4095~-4095
	TIM1->CCR1=abspeed;
	TIM1->CCR2=abspeed;
	TIM1->CCR3=abspeed;
}

void saveNexit(){    //check if saving is required
	for(uint8_t i=0;i<64;i++){
		if(prevpinstorage[i]!=pinstorage[i]){
			mode=MODE_SAVE;
			init=1;
			detectall=0;
			return;
		}
	}
	mode=MODE_MENU;
	init=1;
	return;
}

void printstorage(uint8_t i){    //print address and value with description
	UART_SendString("\r\n");
	UART_SendString(&addrdescription[i][0]);
	for(uint8_t j=0;j<(13-strlen(addrdescription[i]));j++){    //allign data
		UART_Send_Byte(' ');
	}
	char buffer[32];
	sprintf(&buffer[0],"(%2i): %5i ",i,pinstorage[i]);
	UART_SendString(&buffer[0]);
	if(i<32){    //<32 is storage for pins ,>32 is storage for value no need for description 
		UART_Send_Byte('(');
		if(pinstorage[i]<PINCOUNT){    //pin is valid
			UART_SendString(&PXX[pinstorage[i]][0]);
		}else{
			UART_SendString("not set");
		}
		UART_Send_Byte(')');
	}
}

void finduartloop(){
	char teststr[] = {0x11,0x12,0x13,0x14,0x14,0x13,0x12,0x11};
	uint8_t txs[UARTCOUNT], rxs[UARTCOUNT];
	uint8_t tindex=0;
	uint8_t rindex=0;
	uint8_t found=0;
	for(uint8_t i=0;i<UARTCOUNT;i++){    //seperate the tx and rx pins to different array
		if(!used(uarts[i].io)){
			if(uarts[i].tx){
				txs[tindex++]=i;
			}else{
				rxs[rindex++]=i;
			}
		}
	}
	rindex++;
	tindex++;
	for(uint8_t r=0;r<rindex;r++){
		for(uint8_t t=0;t<tindex;t++){
			if(uarts[txs[t]].uart!=uarts[rxs[r]].uart){
				continue;
			}
			for(uint8_t i=0;i<UARTCOUNT;i++){    //disable unused input and output af to impossible value
				pinMode(uarts[i].io, INPUT_ADC);
				pinModeAF(uarts[i].io,GPIO_AF_7);
			}
			found=1;
			pinModeAF(uarts[txs[t]].io,uarts[txs[t]].af);
			pinModeAF(uarts[rxs[r]].io,uarts[rxs[r]].af);
			pinMode(uarts[txs[t]].io, OUTPUT_AF);
			pinMode(uarts[rxs[r]].io, INPUT);
			for(uint8_t i=0;i<8;i++){
				receiveuart=0;
				DELAY_Ms(1);
        UART_Send_Byte((u8)(teststr[i]));
				DELAY_Ms(10);
				if(receiveuart!=teststr[i]){    //send a string and verify if it is looped back sucessfully
					for(uint8_t j=0;j<PINCOUNT;j++){
						if(!(used(j)||j==uarts[txs[t]].io||j==uarts[rxs[r]].io)){
							pinMode(j, INPUT_PULLUP);
						}
					}
					DELAY_Ms(10);
					for(uint8_t j=0;j<PINCOUNT;j++){
						if(!(used(j)||j==uarts[txs[t]].io||j==uarts[rxs[r]].io)){
							pinMode(j, INPUT);
						}
					}
					found=0;
					DELAY_Ms(100);
					break;
				}
			}
			if(found){
				TXPIN=uarts[txs[t]].io;    //save
				RXPIN=uarts[rxs[r]].io;
				EEPROM_Write((u8*)pinstorage, 2 * 64);
				t=100;    //exit loop
				r=100;
				mode=MODE_WAIT_UART;
				for(uint8_t j=0;j<PINCOUNT;j++){
					if(!(used(j)||j==uarts[txs[t]].io||j==uarts[rxs[r]].io)){
						pinMode(j, INPUT_PULLUP);
					}
				}
				DELAY_Ms(1000);
				uint8_t released=0;
				while(!released){
					UART_Send_Byte((u8)'.');
					DELAY_Ms(10);
					if(receiveuart!='.'){
						released=1;
						DELAY_Ms(1000);
					}
				}
				for(uint8_t i=0;i<PINCOUNT;i++){
					if(!used(i)){
						pinMode(i, INPUT);
					}
				}	
				UART_GPIO_Init();    //re initialize
			}
		}
	}
}
	
void waituartloop(){
	if(doinloop){
		DELAY_Ms(1);
		mode=MODE_UART;    //do not loop back
		uint8_t ansi=0;
		uint32_t timeout=0;
		timeout=millis+200;
		UART_SendString("\x1b[5n");
		while(millis<timeout){
			if(receiveuart=='\x1b'||receiveuart=='['){
				ansi=1;
				break;
			}
			__NOP();    //idk why this is needed, but do not remove or it will not work, it took me one day to find
		}
		if(!ansi){
			UART_SendString("\r\nyour serial terminal is not supported");
			UART_SendString("\r\nplease go read the fucking manual");
			UART_SendString("\r\nhttps://t.ly/GFo9T");
			while(1);
		}else{
			UART_SendString("\r\n\x1b[36mpass");
			mode=MODE_MENU;
			init=1;
			sTimingDelay=0;
			
		}
		doinloop=0;
	}else{
		if(counter==0){
			UART_SendString("\n\n\n\n\r");
			UART_Send_Group(&banner,464);
			UART_SendString("Welcome to PinFinder\n\r");
			UART_SendString("press enter to continue");
		}else{
			UART_SendString(".");
			DELAY_Ms(100);
		}
		if(++counter>50){
			counter=0;
		}
	}
}
